Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བསྔགས་པ་མ་ཡིན་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཁོར་གྱི་འཇིགས་པར་ལྷུང་བའི་སེམས་ཅན་རྣམས་ཀྱི་འཁོར་ཏུ་བག་ཚ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཆི་བས་འཇིགས་ཤིང་སྡང་བའི་སེམས་ཅན་རྣམས་ཀྱི་འཆི་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ངན་སོང་གི་གཡང་སས་འཇིགས་ཤིང་སྔང་བའི་སེམས་ཅན་རྣམས་ཀྱི་ངན་སོང་གི་གཡང་སའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཚོ་བ་མེད་པས་འཇིགས་ཤིང་སྐྲག་པའི་སེམས་ཅན་རྣམས་ཀྱི་འཚོ་བ་མེད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དགེ་བའི་རྩ་བ་ཆུད་ཟོས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཆུད་ཟོས་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཉམས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་ཉམས་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སྡིག་ཏོའི་གྲོགས་པོ་དང་ཕྲད་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་སྡིག་ཏོའི་གྲོགས་པོ་དང་ཕྲད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་གྱིས་དོགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་གིས་འཇིགས་ཤིང་བག་ཚ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འཁོར་བའི་གནས་སྣ་ཚོགས་ཀྱི་སྡུག་བསྔལ་གྱིས་འཇིགས་ཤིང་སྐྲག་པ་རྣམས་ཀྱི་འཁོར་བའི་གནས་སྣ་ཚོགས་ཀྱི་སྡུག་བསྔལ་ཀྱི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་སྐལ་བ་མི་མཉམ་པ་དང་ཕྲད་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་སེམས་ཅན་སྐལ་བ་མི་མཉམ་པ་དང་ཕྲད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། དུས་མི་བཟང་བར་སྐྱེས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་དུས་མི་བཟད་པར་སྐྱེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། རིགས་ངན་པར་སྐྱེས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི་རིགས་ངན་པར་སྐྱེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སྡིག་ཏོའི་ལས་བྱས་ཀྱིས་འཇིགས་ཤིང་བག་ཚ་བ་རྣམས་ཀྱི། སྡིག་ཏོའི་ལས་བྱེད་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པས་འཇིགས་ཤིང་སྔང་བ་རྣམས་ཀྱི་ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གནས་དང་འཆིང་བས་འཇིགས་ཤིང་སྔང་བ་རྣམས་ཀྱི་འདུ་ཤེས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གནས་དང་། འཆིང་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་སོ་སོར་མངོན་ཏུ་གྱུར་པར་གནས་པ་མཐོང་ངོ་། །འདི་ལྟ་སྟེ་སྒོ་ང་ལས་སྐྱེས་པའི་སེམས་ཅན་དང་། མངལ་ནས་སྐྱེས་པ་དང་། དྲོད་གཤེར་ལས་སྐྱེས་པ་དང་། རྫུས་ཏེ་སྐྱེས་པ་དང་། གཟུགས་ཡོད་པ་དང་། གཟུགས་མེད་པ་དང་། འདུ་ཤེས་ཡོད་པ་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་ཤེས་ཡོད་པའང་མ་ཡིན། འདུ་ཤེས་མེད་པ་ཡང་མ་ཡིན་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སྨོན་ལམ་གྱི་སྟོབས་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཤུགས་དྲག་པོ་དང་། རྣམ་པར་གནོན་པ་ཤིན་ཏུ་ཡངས་པའི་སྟོབས་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཆེན་པོའི་སྟོབས་དང་། མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་།
en: This means that he saw her becoming present separately for every being in order to dispel the fear of the various sufferings of hell for the beings who were in hell existences; in order to dispel in beings among the various animals the fear of being eaten by one another; in order to dispel the fear of the suffering of hunger, thirst, and so on for beings within Yama’s realm; in order to dispel all fear of the suffering of nāgas for those in nāga existences; in order to dispel all fear of the sufferings of the desire realm for all beings within the desire realms; in order to dispel in those who existed in the human world all fear of being bewildered in the darkness of night; in order to dispel the fear of blame and infamy for those who were preoccupied with criticism, blame, and infamy; in order to dispel the fear of anxiety before an assembly for those beings who had the fear of anxiety before an assembly; in order to dispel the fear of death in those beings who were frightened and terrified of death; in order to dispel the fear of the abyss of the lower existences for those beings who were frightened and terrified of the abyss of the lower realms; in order to dispel the fear of having no livelihood for those beings who were frightened and terrified of having no livelihood; in order to dispel the fear of the loss of their roots of merit for those beings who were frightened of losing their roots of merit; in order to dispel the fear of a diminution of the aspiration for enlightenment for those beings who were afraid of a diminution of their aspiration for enlightenment; in order to dispel the fear of meeting bad companions for those beings who were frightened of meeting bad companions; in order to dispel the fear of separation from kalyāṇamitras in those beings who were frightened of separation from kalyāṇamitras; in order to dispel the fear of falling to the level of śrāvakas and pratyeka­buddhas in those beings who were frightened of falling to the level of śrāvakas and pratyeka­buddhas; in order to dispel the fear of the various kinds of suffering in saṃsāra for those beings who were afraid of the various kinds of suffering in saṃsāra; in order to dispel the fear of meeting contrary beings for those beings who were frightened and afraid of meeting contrary beings; in order to dispel the fear of unfortunate times in those beings who were frightened and afraid of unfortunate times; in order to dispel the fear of rebirth into unfortunate families in those beings who were frightened and afraid of rebirth into unfortunate families; in order to dispel the fear of committing bad actions for those beings who were frightened and afraid of committing bad actions; in order to dispel the fear of the obscurations of karma and kleśas for those beings who were frightened and afraid of the obscurations of karma and kleśas; and in order to dispel the fear of the bondage of remaining fixed in a variety of conceptions for those beings who were frightened and afraid of remaining fixed in a variety of conceptions.

source: སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོའི་ཤུགས་དྲག་པོ་ཤིན་ཏུ་སྐྱེས་པའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པའི་བྱམས་པ་ཆེན་པོས་རྒྱས་པར་དགང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཡེ་ཤེས་རབ་ཏུ་བསྒྲུབ་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་ལྡན་པས་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པར་གནས་པར་མཐོང་ངོ་། །ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུས་ཤེས་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ལ་མངོན་དུ་གྱུར་པ་དང་།
en: This means he saw her, being present in and purifying all realms, through possessing the supremacy of the vast miraculous powers of bodhisattva liberation and through the accomplishment of the power of the prayer to protect all beings: beings born from eggs, born from wombs, born from warm moisture, born spontaneously, and with form, without form, with perception, without perception, and neither with perception nor without perception; through the vast prowess of the power of bodhisattva samādhi; through the power of the great higher cognitions of a bodhisattva; through the power of attaining the completely good conduct and prayer of a bodhisattva; and through developing the power of an ocean of the ways of compassion; in order to spread everywhere the great love for all beings that is free of attachment; in order to create happiness for all beings and increase the power of their joy; and so that all beings will accomplish the accumulation of wisdom.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསྩགས་པ་ལ་མངོན་དུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་སྒྲིབ་པ་མེད་པར་མངོན་དུ་གྱུར་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མོས་པ་རྒྱ་མཚོ་རྣམ་པར་སྦྱང་བ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པའི་ཆོས་རྣམ་པར་བཟློག་པ་ལ་མངོན་དུ་གྱུར་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཤེས་པའི་མུན་པ་རྣམ་པར་བསྩལ་བ་ལ་མངོན་དུ་གྱུར་ཅིང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པའི་དོན་དུ་གནས་པ་མཐོང་ངོ་། །
en: He saw her focused on knowing the knowledge of all Dharmas; being present there focused on making offerings and honoring all buddhas; focused on holding the teachings of all the tathāgatas; focused on the accumulation of all roots of merit; focused on the increase of all bodhisattva conduct; focused on the minds of all beings being free of obscurations; focused on ripening the faculties of all beings; focused on purifying the ocean of the aspirations of all beings; focused on dispelling obscuring qualities in all beings; focused on dispersing the darkness of ignorance in all beings; and focused on creating the light of omniscient wisdom.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་། འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལྟ་བུར་མཐོང་ནས་རབ་ཏུ་དགའ་བ་སྐྱེས་ཏེ། སྤྲོ་བ་ཆེན་པོའི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་ནས།
en: When Sudhana, the head merchant’s son, had seen this miraculous prowess of the night goddess Samanta­sattva­trāṇojaḥ­śrī’s inconceivable bodhisattva liberation called the manifestations that guide beings that appear in all worlds, he was overjoyed and acquired an ocean of the power of great delight.

source: མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ་ཕྱག་བྱས་ནས་ངོར་གྱེན་དུ་བལྟས་སོ། །
en: He prostrated with his entire body before the night goddess Samanta­sattva­trāṇojaḥ­śrī and then stood and gazed upon her.

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དང་། མཚན་རྣམ་པར་དག་པ་རེ་མི་སྣང་བར་བྱས་ཏེ། མཚན་མོའི་ལྷ་མོའི་གཟུགས་སུ་བྱས་ཏེ། རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་འབྱིན་ཅིང་འདུག་པར་གནས་སོ། །
en: Then the night goddess Samanta­sattva­trāṇojaḥ­śrī made her appearance in the pure form and physical signs of a bodhisattva vanish, and she remained in the form of a night goddess emanating all miraculous manifestations.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཁྱོད་ཀྱི་སྐུ་ཡང་མཚན་རབ་རྒྱན་གྱིས་བརྒྱན། །ཤིན་ཏུ་བཟང་ཞིང་མཛེས་པ་བདག་གིས་མཐོང་། །ནམ་མཁའ་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ་བཞིན། །དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བྲིས་པ་མཐོང་། །
en: At that time, Sudhana, the head merchant’s son, standing with hands together in homage before the night goddess Samanta­sattva­trāṇojaḥ­śrī, recited these verses to her: “I have seen your vast body Adorned by the excellent, beautiful signs And the wonderful special features, Like the sky adorned by stars.

source: འོད་ཀྱི་འཁོར་ཅན་སྐུ་བཟང་དམ་པའི་མཆོག །མཐའ་ཡས་ཞིང་གི་རྡུལ་ཁམས་མང་པོ་སྙེད། །ཁ་དོག་སྣ་ཚོགས་རྣམ་པའི་དཔེ་ཚུལ་དུ། །ཕྱོགས་རྣམས་ཀུན་གྱི་དབྱིངས་སུ་ཁྱབ་པར་གང་། །
en: {1} “Your perfect, beautiful body’s halo of light rays As numerous as the atoms in infinite realms, With its multicolored, incomparable radiance, Spreads throughout the extent of every direction.

source: འོད་ཟེར་དྲ་བ་མང་པོ་འགྲོ་སེམས་མཉམ། །ཁྱོད་ཀྱི་བ་སྤུའི་སྒོ་ནས་འགྱེད་པ་མཛད། །
en: {2} “From the pores of your body shine As many networks of light rays as there are minds of beings.

source: འོད་ཟེར་སྒོ་ལ་པདྨོའི་ཡིད་འོང་གནས། །ཁྱོད་ཀྱི་སྤྲུལ་པ་འགྲོ་བའི་སྡུག་བསྔལ་སེལ། །
en: At the tip of each light ray an emanation of yours, Seated upon a beautiful lotus, eliminates the sufferings of beings.

source: སྤོས་ཀྱི་ན་བུན་སྤྲིན་དུ་ཆགས་པ་འགྱེད། །འགྲོ་བའི་གཟུགས་སུ་གནས་ཏེ་ཀུན་ནས་མཛེས། །
en: {3} “Clouds of incense mists are emitted, Taking on the forms of beautiful beings.

source: མེ་ཏོག་སྒོ་རྣམས་ཀུན་ནས་དགྱེ་མཛད་པས། །ཆོས་དབྱིངས་བཞུགས་པའི་རྒྱལ་བ་ཀུན་ཏུ་ཁྱབ། །
en: Flowers spread out everywhere To all the jinas in the realm of phenomena.

source: ཁྱོད་ཀྱི་ཕྲག་པའི་ལྷུན་ཡངས་འཕགས་པ་ནི། །རིན་ཆེན་འོད་འཕྲོ་རི་བོ་རི་རབ་འདྲ། །དྲི་མེད་དེ་ནི་འགྲོ་བ་ཀུན་ཏུ་གསལ། །གཏི་མུག་མུན་ནག་རྣམ་པར་བཟློག་པ་མཛད། །
en: {4} “The vast, sublime mass of your shoulders Shines with stainless jewel light, the size of Mount Meru, With which you illuminate all beings, Dispelling the darkness of ignorance.

source: ཁྱོད་ཀྱི་དྲི་མེད་ཞལ་མདོག་བཟང་བ་ལས། །ན་བུན་སྤྲིན་དང་ཉི་མ་ཡངས་པ་འབྱུང་། །
en: {5} “Vast masses of clouds of suns are emanated From your beautifully colored, stainless face.

source: ཁྱོད་ཀྱི་ཉི་མའི་འཁོར་འདྲ་འོད་བཟང་བ། །རྣམ་པར་སྣང་མཛད་སྤྱོད་ཡུལ་ཡངས་པ་འབྱིན། །
en: Your wonderful light, which is like the disk of the sun, Is emanated throughout Vairocana’s vast field of activity.

source: ཁྱོད་ཀྱི་སྤྱན་ནས་ཟླ་སྐར་འོད་འབྱུང་བ། །རྟག་ཏུ་དྲི་མེད་སྤྲིན་ལྟར་མང་བ་སྟེ།
en: {6} “Clouds of the stainless light of the moon and the stars Are constantly emanated from your eyes.

source: དེ་དག་ཕྱོགས་བཅུར་བཀང་ཞིང་འགྲོ་བ་རྣམས། །རབ་ཏུ་སྣང་བྱེད་འཇིག་རྟེན་རབ་རིབ་སེལ། །
en: They spread throughout the ten directions, Illuminating beings and eliminating the world’s blindness.

source: ཁྱོད་ཀྱི་མཚན་ལས་འགྲོ་བའི་ལུས་མཉམ་པའི། །སྤྲུལ་པ་རྒྱ་མཚོ་ཕྱོགས་སུ་ཁྱབ་པར་འཕྲོ། །
en: {7} “An ocean of emanations as numerous as the bodies of beings Is emanated into all directions from your physical signs of a great being.

source: དེ་དག་ཆོས་དབྱིངས་ཡངས་པར་རྒྱས་འགེངས་ཤིང་། །སེམས་ཅན་ཚད་མེད་ཚོགས་རྣམས་ཡོངས་སུ་འདུལ། །
en: They spread throughout the vast realm of phenomena And guide the immeasurable multitudes of beings.

source: ཁྱོད་ཀྱི་སྐུ་ནི་འབྱམ་ཀླས་ཕྱོགས་སུ་སྣང་། །འགྲོ་བ་ཀུན་ལ་མངོན་གྱུར་དགའ་བ་བསྐྱེད། །རྒྱལ་པོ་མེ་དང་རྐུན་པོ་ཆུས་བསྐྱེད་པའི། །འཇིགས་པ་ཐམས་ཅད་རྣམ་སེལ་ཞི་བར་མཛད། །
en: {8} “Your body appears throughout the extent of the directions, Appearing to all beings and bringing them happiness, Dispelling and alleviating all fears Created by kings, fire, thieves, and water.

source: གང་ཚེ་ཁྱོད་ཀྱི་སྤྱན་སྔར་བདག་བཏང་ནས། །ཡོན་ཏན་རྣམ་པར་སེམས་ཤིང་ཉེར་ཕྱིན་པ། །
en: {9} “When I was sent into your presence, I approached you contemplating good qualities.

source: དེའི་ཚེ་འོད་ཟེར་དྲི་མེད་འཁོར་བཟང་བ། །ཁྱོད་ཀྱི་ཞལ་གྱི་སྨིན་མཚམས་གསེབ་ནས་འཐོན། །
en: At that time a beautiful, stainless mass of light rays Radiated from between your eyebrows.

source: ཕྱོགས་རྣམས་རྒྱ་མཚོ་བརྒྱ་མང་སྣང་མཛད་ནས། །འཇིག་རྟེན་སྣང་བ་རྒྱ་ཆེ་ཡོངས་བསྐྱེད་དེ། །
en: {10} “They illuminated hundreds of oceans of directions And created a vast radiance in the world.

source: རྣམ་འཕྲུལ་རྣམ་པ་མང་པོ་རྣམ་བསྟན་ནས། །དེ་ཚེ་བདག་གི་ལུས་ཀྱི་གསེབ་ཏུ་ཞ། །
en: They revealed many miraculous manifestations, And at that time they entered into my body.

source: གང་ཚེ་འོད་ཀྱི་འཁོར་གྱིས་བདག་རེག་པ། །དེ་ཚེ་བདེ་བ་རྨད་བྱུང་ཡངས་པ་མྱོང་། །
en: {11} “When that mass of light touched me, At that time I experienced a marvelous bliss.

source: གཟུངས་དང་ཏིང་འཛིན་བརྒྱ་མང་ཡོངས་སུ་གནོན། །ཕྱོགས་བཅུའི་རྒྱལ་བ་དཔག་ཡས་མཐོང་བར་འགྱུར། །
en: I gained mastery of many hundreds of dhāraṇīs and samādhis, And I saw limitless jinas in the ten directions.

source: གོམ་པ་རྣམ་བོར་གྱེན་དུ་བཏེག་པ་ལའང་། །རྡུལ་ཕྲན་གྲངས་སྙེད་ཚུལ་ནི་བདག་གིས་རིག །རྡུལ་ཕྲན་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་ཡང་། །ཞིང་གི་རྡུལ་སྙེད་ཞིང་རྣམས་མཐོང་བར་གྱུར། །རྡུལ་ལ་གནས་ཀྱང་རྣམ་པ་ཐ་དགུ་སྟེ། །
en: {12} “Wherever I stepped with my feet I could perceive the number of atoms there, And I saw in every single atom Realms as numerous as a realm’s atoms.

source: ཞིང་མང་བརྒྱ་ནི་ཤིན་ཏུ་ཉོན་ཡང་མོངས། །དེ་ཡི་འགྲོ་བ་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་། །ཆོང་ངེར་ངུ་ཞིང་སྨྲེ་སྔགས་ཡོངས་སུ་འདོན། །
en: {13} “There were many hundreds of defiled realms Of many different kinds, located in atoms In which beings experienced suffering, Crying out with the sounds of lamentation and wailing.

source: ཞིང་མང་ལ་ལ་ཀུན་ནས་ཉོན་མོངས་དག །དེ་ན་སྡུག་བསྔལ་མང་ཞིང་བདེ་བ་ཆུང་། །རྒྱལ་བ་ཐུགས་རྗེ་ཅན་ཡང་དེར་སྐྱེས་ཏེ། །རྒྱལ་བའི་ཉན་ཐོས་རང་རྒྱལ་དེ་བཞིན་ནོ། །ཞིང་ཚུལ་ལ་ལ་ཡོངས་དག་ཉོན་མོངས་ཏེ། །
en: {14} “There were also many realms both defiled and pure, In which there was much suffering and little happiness, In which the compassionate jinas took birth, As did the jinas’ śrāvakas and pratyeka­buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་གནས་བཟངས་མང་པོས་བརྒྱན། །སྐྱེས་པ་བུད་མེད་ཡོངས་བརྒྱན་བལྟ་ན་སྡུག །སྐྱོན་མེད་རྒྱལ་བའི་གདུང་ཡང་རྒྱུན་མི་འཆད། །
en: {15} “There were some realms, purified of defilements, That were ornamented by the presence of many bodhisattvas And adorned by beautiful men and women, And the brilliant family of the jinas resided there.

source: ཞིང་རྣམས་རྒྱ་མཚོ་ཡངས་ཤིང་དྲི་མེད་པ། །རྡུལ་ལ་གནས་ཤིང་མཉམ་པའི་གཞི་དང་ལྡན། །དེ་དག་བསྐལ་པ་བརྒྱ་མང་སྔོན་གྱི་ཚེ། །རྣམ་པར་སྣང་མཛད་སྤྱོད་མཛད་ཡོངས་སུ་སྦྱངས། །
en: {16} “There were vast, stainless oceans of realms, With level surfaces, that were located in atoms, Where for many hundreds of kalpas Vairocana purified his conduct in the past.

source: ཞིང་རྣམས་འབྱམ་ཀླས་ཀུན་ནས་རྒྱལ་བ་དག །ཤིང་དབང་དམ་པའི་དྲུང་དུ་གཤེགས་པ་སྟོན། །རྣམ་པར་འཕྲུལ་ཞིང་བྱང་ཆུབ་འཚང་ཡང་རྒྱ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཅིང་འདུལ་བ་སྟོན། །
en: {17} “Within that entire vast extent of realms, Jinas were revealed going to the lord of trees, Attaining enlightenment, manifesting miracles, Turning the wheel of the Dharma, and guiding beings.

source: རྣམ་པར་སྣང་མཛད་སྤྱོད་ཡུལ་ཡངས་པ་ལ། །ཁྱོད་ཀྱང་ཀུན་ཏུ་རྗེས་སུ་བཞུད་པར་མཐོང་། །མཆོད་པ་སྟོང་ཕྲག་ཚད་མེད་ཁྲག་ཁྲིག་གིས། །རྒྱལ་བ་ཀུན་ལ་མངོན་པར་མཆོད་མཛད་མཐོང་། །
en: {18} “And I saw you also following In the vast scope of Vairocana’s activity And making offerings equally to all the jinas With countless millions of billions of offerings.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ། དེ་ལྟ་བུ་ཟབ་པ་ནི་ངོ་མཚར་ཆེ་ན།
en: {19} When Sudhana, the head merchant’s son, had recited those verses, he said to the night goddess Samanta­sattva­trāṇojaḥ­śrī, “Goddess, that profound bodhisattva liberation is a great wonder.

source: རྣམ་པར་ཐར་བ་དེའི་མིང་ནི་ཅི་ཞེས་བགྱི།
en: What is the name of that liberation?

source: དེ་ཁྱོད་ཀྱིས་བརྙེས་ནས་ཡུན་ནི་ཇི་སྲིད་ཅིག་ལགས།
en: How long ago did you attain it?

source: བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་ནན་ཏན་དུ་བགྱིས་ན་རྣམ་པར་ཐར་པ་དེ་ཡོངས་སུ་དག་པར་འགྱུར།
en: How does a bodhisattva practice in order to purify that bodhisattva liberation?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་གནས་འདི་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་སུ་བཅས་པས་ཡིད་ཆེས་པར་དཀའ་བ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་ལྷུར་ལེན་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཞུགས་པ།
en: The night goddess Samanta­sattva­trāṇojaḥ­śrī said, “Noble one, this subject is difficult to believe in for the world and its devas, as well as for the śrāvakas and pratyeka­buddhas.

source: མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོའི་ལམ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་ལ་ཞུགས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ། བླ་ན་མེད་པར་བྱ་བ་ལ་ཞུགས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པའི་རིགས་རྒྱུན་མི་གཅད་པ་ལ་ཞུགས་པ།
en: Why is that?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ལ་ཞུགས་པ། བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པས། གནས་པར་བྱ་བའི་སྨོན་ལམ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ཞུགས་པ། ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྒྲིབས་པ་མེད་པའི་ཡེ་ཤེས་སྣང་བ་རྣམ་པར་སྦྱང་བ་ལ་ཞུགས་པ། སྐད་ཅིག་རེ་རེ་ཞིང་དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཡེ་ཤེས་སྣང་བས།
en: Because it is the field of practice of those bodhisattvas who follow the completely good conduct and prayer of the bodhisattvas; who are dedicated to the essence of compassion; who are engaged in saving all beings; who purify the paths that lead to all unfortunate and lower realms; who purify all realms to become the highest buddha realms; who create the unbroken continuity of the Buddha’s family in all buddha realms; who hold the teachings of all the buddhas; who have oceans of great prayers for remaining in the practice of bodhisattva conduct throughout all kalpas; and who create the pure light of wisdom, free of darkness, for all the oceans of Dharma; and those bodhisattvas who in each instant have attained the state of remaining in the light of wisdom of the entire ocean of the ways of the three times.

source: རྣམ་པར་གནས་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱི་ཡུལ་ཏེ། འོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བསྟན་པར་བྱའོ། །
en: However, through the blessing of the Tathāgata, I will teach it.

source: རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་གི་ཕ་རོལ་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བར་བསྐལ་པ་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, in the past beyond kalpas as numerous as the atoms in a buddha realm, there was a world realm called Vairocana­tejaḥśrī during a kalpa called Virajomaṇḍala.

source: བསྐལ་པ་དེ་ལས་སངས་རྒྱས་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བར་གྱུར་ཏོ། །
en: In that kalpa there appeared as many buddhas as there are atoms in Sumeru.

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་དེ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་སྟེ། རྡོ་རྗེ་ལས་བྱས་པའི་གཞལ་མེད་ཁང་དང་། གནས་ཀྱིས་ཡོངས་སུ་མཛེས་པར་བྱས་པའོ། །
en: In that world realm called Vairocana­tejaḥśrī there was an array of clouds of all jewels, and it was beautified by aerial palaces made of diamonds.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་གཞི་ནི་རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྒྱ་མཚོ་ལས་བླངས་པ་སྟེ།
en: “That world realm was situated on a foundation of an ocean of the kings of jewels possessing stainless light.

source: ལྷུན་དང་ལུས་ནི་ནོར་བུ་རིན་པོ་ཆེའི་སྤོས་ཐམས་ཅད་ཀྱི་རྒྱལ་པོ་ལས་གྱུར་པའོ། །
en: Its solid body was formed from precious jewels possessing all the kings of perfumes.

source: དེ་ནི་དབྱིབས་ཀུན་ཏུ་ཟླུམ་པ་སྟེ།
en: It was completely round in shape.

source: རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ།
en: It was both pure and defiled.

source: ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་བླ་རེས་ཀུན་ནས་ཁྱབ་པ།
en: It was covered by a canopy of clouds of every adornment.

source: རིན་པོ་ཆེའི་ཁོར་ཡུག་རྒྱན་ཐམས་ཅད་དང་ལྡན་པ།
en: It had the array of a thousand precious Cakravāla mountains.

source: རིམ་པ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་བ། གླིང་བཞི་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་ཤིན་ཏུ་རྒྱས་པར་བརྒྱན་པ་སྟེ།
en: It was adorned by a quintillion four-continent worlds.

source: དེ་ལ་གླིང་བཞི་པ་ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་སྟེ། སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་པའི་ལས་དང་ལྡན་པ་རྣམས་ཀྱི་གནས་སོ། །
en: Some four-continent worlds were defiled and were the dwelling places of beings who had defiled karma.

source: ལ་ལ་ནི་ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་དག་པ་སྟེ། སེམས་ཅན་ལས་འདྲེན་མ་དང་ལྡན་པ་རྣམས་ཀྱི་གནས་སོ། །
en: Some were the dwelling places of beings who had a mixture of both defiled and pure karma.

source: ལ་ལ་ནི་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་སྟེ། སེམས་ཅན་ཡོངས་སུ་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ་དགེ་བའི་རྩ་བ་སྦྱངས་པ། ཁ་ན་མ་ཐོ་བ་ཉུང་བ་རྣམས་ཀྱི་གནས་སོ། །
en: Some were the dwelling places of beings who were pure and also defiled, who had pure good actions and few blameworthy actions.

source: ལ་ལ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དག་པ་རྣམས་ཀྱི་གནས་སོ། །
en: Some were the dwelling places of pure bodhisattvas.

source: འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་དེའི་ཤར་ཕྱོགས་ལོགས་ཀྱི་ཁོར་ཡུག་གི་མཚམས་ན། གླིང་བཞི་བའི་རིན་ཆེན་མེ་ཏོག་སྒྲོན་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་རྣམ་པར་དག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པ།
en: “To the east of the world realm Vairocana­tejaḥśrī, next to the Cakravāla mountains, there was a four-continent world called Ratna­kusuma­pradīpa­dhvajā. It was pure but defiled.

source: མ་རྨོས་མ་བསྐྱེད་པའི་འབྲས་ལ་ཡོངས་སུ་སྤྱོད་པ།
en: There beings enjoyed the unplowed harvests.

source: སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་མངོན་པར་གྲུབ་པའི་ཁང་པ་བརྩེགས་པའི་གནས་དང་། གཞལ་མེད་ཁང་ལ་ཡོངས་སུ་སྤྱོད་པ།
en: They lived in kūṭāgāras and aerial palaces that were created by the ripening of their past karma.

source: འཁོར་ཀུན་ནས་ཡིད་བཞིན་གྱི་ཤིང་གིས་འཁོར་བ།
en: It was encircled by wish-fulfilling trees.

source: སྤོས་ཀྱི་ཤིང་སྣ་ཚོགས་ཀྱི་ལྷུན་ལས་སྤོས་ཀྱི་སྤྲིན་རྒྱུན་མི་འཆད་པར་འབྱུང་བ།
en: There were various kinds of aromatic trees that continually released clouds of perfume.

source: ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་ཤིང་ལས་ཕྲེང་བའི་སྤྲིན་རྒྱུན་མི་འཆད་པར་འབྱུང་བ།
en: There were various kinds of garland trees that continually released clouds of garlands.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཤིང་ལས་མེ་ཏོག་ཁ་དོག་དང་། དྲི་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྲིན་ཀྱི་ཆར་རྒྱུན་མི་འཆད་པར་འབབ་པ། ཕྱེ་མ་དང་།
en: There were various kinds of flowering trees from which fell a continuous rain of clouds of flowers with inconceivable colors and scents.
